Revit 2027 API
ConceptualConstructionType.MaterialId Property
 Material used for visualization of this construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; set; }
Public Property MaterialId As ElementId
	Get
	Set
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MaterialId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input element materialId is not a material element.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace